Инструменты (Function Calling) служат для того чтобы нейросеть могла либо запросить недостающие данные, либо создать задание внешней программе.

Процесс выглядит так:

Нейросеть осведомлена какие Инструменты доступны, ей передаются их описания в структурированном виде
Анализирует запрос и понимает нужно ли вызывать Инструмент
Если модель решила использовать инструмент, она:
Опираясь на описание Инструмента преобразовывает введённый текст
вместо текстового ответа возвращает запрос на выполнение Инструмента
Синтез Финального Ответа. Модель получает сырые данные от инструмента и, опираясь на контекст первоначального запроса, формулирует понятный для человека ответ.



